BEGIN;

INSERT INTO weapon_class(id, name)
VALUES 
    (1, 'Пистолеты'),
    (2, 'Пистолеты-пулеметы'),
    (3, 'Дробовики'),
    (4, 'Пулеметы'),
    (5, 'Штурмовые винтовки'),
    (6, 'Снайперские винтовки'),
    (7, 'Дополнительное снаряжение'),
    (8, 'Другое'),
    (9, 'Гранаты');

INSERT INTO weapon(id, name, class_id)
VALUES
    (1, 'P2000', 1),
    (2, 'Glock', 1),
    (3, 'P250', 1),
    (4, 'Desert Deagle', 1),
    (5, 'Five Seven', 1),
    (6, 'Dual Berettas', 1),
    (7, 'Tec-9', 1),
    (8, 'CZ75-Auto', 1),
    (9, 'USP-S', 1),
    (10, 'Револьвер R8', 1),

    (101, 'MP7', 2),
    (102, 'MP9', 2),
    (103, 'PP-Bizon', 2),
    (104, 'MAC-10', 2),
    (105, 'UMP-45', 2),
    (106, 'P90', 2),
    (107, 'MP5-SD', 2),

    (201, 'Sawed-Off', 3),
    (202, 'Nova', 3),
    (203, 'MAG-7', 3),
    (204, 'XM1014', 3),

    (205, 'M249', 4),
    (206, 'Negev', 4),

    (301, 'Galil AR', 5),
    (302, 'FAMAS', 5),
    (303, 'AK-47', 5),
    (304, 'M4A4', 5),
    (305, 'M4A1-S', 5),
    (307, 'SG 553', 5),
    (308, 'AUG', 5),
    
    (309, 'AWP', 6),
    (310, 'SCAR-20', 6),
    (311, 'G3SG1', 6),
    (306, 'SSG 08', 6),

    (401, 'Zeus x27', 7),
    (404, 'C4', 7),
    (405, 'Нож', 7),

    (407, 'Мир', 8),

    (501, 'Ложная граната', 9),
    (502, 'Коктейль молотов', 9),
    (503, 'Зажигательная граната', 9),
    (504, 'Световая граната', 9),
    (505, 'Дымовая граната', 9),
    (506, 'Осколочная граната', 9);

COMMIT;

